In [1]:
import pandas as pd

In [4]:
names = {
    'Roll NO': [40, 31, 7, 23, 35, 36] ,
    'Names': ['Sandy', 'John', 'Anna', 'Oppa', 'Doe', 'Belle']
}
ages= {
    'Roll NO' : [3, 7, 48, 32, 40, 9],
    'Age': [19, 20, 21, 18, 19, 30]
}

In [5]:
df1 = pd.DataFrame(names)
df2 = pd.DataFrame(ages)

## Merging in Pandas
Merging in pandas is a powerful feature that allows you to combine data from multiple DataFrames.It has following parameters:
### on:- 
Column or index level names to join on. These must be found in both DataFrames.
### how:-
Type of merge to be performed. *left , right, outer, inner, cross,* default= 'inner'

__left__ - use only keys from left frame

__right__ - use only keys from right frame

__outer__ - use union of keys from both frames

__inner__ - use intersection of keys from both frames

__cross__ - creates the cartesian product from both frames, preserves the order of the left keys

In [18]:
#merging these two  in one dataframe
df = pd.merge(df1, df2, on = 'Roll NO',how = 'outer' )
df.set_index('Roll NO', inplace = True)

In [19]:
df #NaN = Not a number i.e. missing values

         Names   Age
Roll NO
40       Sandy  19.0
31        John   NaN
7         Anna  20.0
23        Oppa   NaN
35         Doe   NaN
36       Belle   NaN
3          NaN  19.0
48         NaN  21.0
32         NaN  18.0
9          NaN  30.0